MakerLabMe/STM32_Arduino_Cores/boards.txt

MakerLab_SUN_Proto.name=MakerLab SUN Prototype 
MakerLab_SUN_Proto.vid.0=0x10C4
MakerLab_SUN_Proto.pid.0=0xEA60
MakerLab_SUN_Proto.upload.tool=sloadhost
MakerLab_SUN_Proto.upload.protocol=
MakerLab_SUN_Proto.upload.maximum_size=383216
MakerLab_SUN_Proto.upload.use_1200bps_touch=false
MakerLab_SUN_Proto.upload.wait_for_upload_port=false
MakerLab_SUN_Proto.upload.native_usb=false
MakerLab_SUN_Proto.build.mcu=cortex-m3
MakerLab_SUN_Proto.build.f_cpu=72000000L
MakerLab_SUN_Proto.build.usb_product="MakerLab_SUN_Proto"
MakerLab_SUN_Proto.build.board=STM32_SUN
MakerLab_SUN_Proto.build.core=arduino
MakerLab_SUN_Proto.build.extra_flags=-DSTM32F10X_HD -mthumb {build.usb_flags}
MakerLab_SUN_Proto.build.ldscript=linker_scripts/gcc/flash.ld
MakerLab_SUN_Proto.build.variant=sun_prototype
MakerLab_SUN_Proto.build.variant_system_lib=libstm_stm32f10x_hd_gcc_rel.a
MakerLab_SUN_Proto.build.vid=0x10C4
MakerLab_SUN_Proto.build.pid=0xEA60

MakerLab_SUN_usb.name=MakerLab SUN R1(Native USB not working)
MakerLab_SUN_usb.vid.0=0x2341
MakerLab_SUN_usb.pid.1=0x003d
MakerLab_SUN_usb.upload.tool=sloadhost
MakerLab_SUN_usb.upload.protocol=
MakerLab_SUN_usb.upload.maximum_size=393216
MakerLab_SUN_usb.upload.use_1200bps_touch=false
MakerLab_SUN_usb.upload.wait_for_upload_port=false
MakerLab_SUN_usb.upload.native_usb=true
MakerLab_SUN_usb.build.mcu=cortex-m3
MakerLab_SUN_usb.build.f_cpu=72000000L
MakerLab_SUN_usb.build.usb_product="MakerLab_SUN_R1"
MakerLab_SUN_usb.build.board=STM32_SUN
MakerLab_SUN_usb.build.core=arduino
MakerLab_SUN_usb.build.extra_flags=-DSTM32F10X_HD -mthumb {build.usb_flags}
MakerLab_SUN_usb.build.ldscript=linker_scripts/gcc/flash.ld
MakerLab_SUN_usb.build.variant=arduino_due_x
MakerLab_SUN_R1.build.variant_system_lib=libstm_stm32f10x_hd_gcc_rel.a
MakerLab_SUN_usb.build.vid=0x2341
MakerLab_SUN_usb.build.pid=0x003e

MakerLab_SUN_R1.name=MakerLab SUN R1(USB_To_Serial)
MakerLab_SUN_R1.vid.0=0x10C4
MakerLab_SUN_R1.pid.0=0xEA60
MakerLab_SUN_R1.upload.tool=sloadhost
MakerLab_SUN_R1.upload.protocol=
MakerLab_SUN_R1.upload.maximum_size=393216
MakerLab_SUN_R1.upload.use_1200bps_touch=false
MakerLab_SUN_R1.upload.wait_for_upload_port=false
MakerLab_SUN_R1.upload.native_usb=false
MakerLab_SUN_R1.build.mcu=cortex-m3
MakerLab_SUN_R1.build.f_cpu=72000000L
MakerLab_SUN_R1.build.usb_product="MakerLab_SUN_R1"
MakerLab_SUN_R1.build.board=STM32_SUN
MakerLab_SUN_R1.build.core=arduino
MakerLab_SUN_R1.build.extra_flags=-DSTM32F10X_HD -mthumb {build.usb_flags}
MakerLab_SUN_R1.build.ldscript=linker_scripts/gcc/flash.ld
MakerLab_SUN_R1.build.variant=sun
MakerLab_SUN_R1.build.variant_system_lib=libstm_stm32f10x_hd_gcc_rel.a
MakerLab_SUN_R1.build.vid=0x10C4
MakerLab_SUN_R1.build.pid=0xEA60

